#+HUGO_BASE_DIR: ./dh-website/
#+HUGO_SECTION: slides/
#+HUGO_STATIC_IMAGES: images/
#+HUGO_MENU: :menu main :weight 10
#+HUGO_CUSTOM_FRONT_MATTER: :banner "testbanner"
#+MACRO: ts (eval (get-ts+7))
#+OPTIONS: todo:nil

** COMMENT Readings/Notes                                         :noexport:
:PROPERTIES:
:CUSTOM_ID: comment-readings/notes-7e81
:END:
#+begin_src sh :results output
${HOME}/src/extract_pdf_annotations_to_orgmode/vkextract_annotations_to_orgmode_snippet.sh DH/Readings/Habermas-public-1964
#+end_src

#+RESULTS:
#+begin_example
---- HIGHLIGHTS: ---
portion of the public sphere comes into being in every conversation in which private individuals assemble to form a public body.' They then behave neither like business or professional people transacting private affairs, nor like members of a constitutional order subject to the legal constraints of a state bureaucracy. Citizens behave as a public body when they confer in an unrestricted fashion-that is, with the guarantee of freedom of assembly and association and the freedom to express and publish their opinions-about matters of general interest. In a large public body this kind of communication requires specific means for transmitting information and influencing those who receive it. Today newspapers and magazines, radio and television are the media of the public sphere. We speak of the political public sphere in contrast, for instance, to the literary one, when public discussion deals with objects connected to the activity of the state. Although state authority is so to speak the executor of the political public sphere, it is not a part of it.2

The state and the public sphere do not overlap, as one might suppose from casual language use. Rather they confront one another as opponents. Habermas designates that sphere as public which antiquity understood to be private, i.e. the sphere of non-governmental opinion making.

The expression "public opinion" refers to the tasks of criticism and control which a public body of citizens informally-and, in periodic elections, formally as well- practices &-d-vis the ruling structure organized in the form of a state.

It is no coincidence that these concepts of the public sphere and public opinion arose for the first time only in the eighteenth century. They acquire their specific meaning from a concrete historical situation. It was at that time that the distinction of "opinion" from "opinion publique" and "public opinion" came about. Though mere opinions \(cultural assumptions, normative attitudes, collective prejudices and values\) seem to persist unchanged in their natural form as a kind of sediment of history, public opinion can by definition only come into existence when a reasoning public is presupposed. Public discussions about the exercise of political power which are both critical in intent and institutionally guaranteed have not always existed- they grew out of a specific phase of bourgeois society and could enter into the order of the bourgeois constitutional state only as a result of a particular constellation of interests.

By the end of the eighteenth century they had broken apart into private elements on the one hand, and into public on the other. The position of the church changed with the reformation: the link to divine authority which the church represented, that is, religion, became a private matter. So-called religious freedom came to insure what was historically the first area of private autonomy. The church itself continued its existence as one public and legal body among others. The corresponding polarization within princely authority was visibly manifested in the separation of the public budget from the private household expenses of a ruler.

The press remained an institution of the public itself, effective in the manner of a mediator and intensifier of public discussion, no longer a mere organ for the spreading of news but not yet the medium of a consumer culture

Even in the Paris of 1848 every half-way eminent politician organized his club, every other his journal: 450 clubs and over 200 journals were established there between February and May alone. Until the permanent legalization of a politically functional public sphere, the appearance of a political newspaper meant joining the struggle for freedom and public opinion, and thus for the public sphere as a principle. Only with the establishment of the bourgeois constitutional state was the intellectual press relieved of the pressure of its convictions. Since then it has been able to abandon its polemical position and take advantage of the earning possibilities of a commercial undertaking. In England, France, and the United States the transformation from a journalism of conviction to one of commerce began in the 1830s at approximately the same time. In the transition from the literary journalism of private individuals to the public services of the mass media the public sphere was transformed by the influx of private interests, which received special prominence in the mass media.

Because of the diffusion of press and propaganda, the public body expanded beyond the bounds of the bourgeoisie. The public body lost not only its social exclusivity; it lost in addition the coherence created by bourgeois social institutions and a relatively high standard of education. Conflicts hitherto restricted to the private sphere now intrude into the public sphere. Group needs which can expect no satisfaction from a self- regulating market now tend towards a regulation by the state. The public sphere, which must now mediate these demands, becomes a field for the competition of interests, competitions which assume the form of violent conflict. Laws which obviously have come about under the "pressure of the. street" can scarcely still be understood as arising from the consensus of private individuals engaged in public discussion. They correspond in a more or less unconcealed manner to the compromise of conflicting private interests.

With the interweaving of the public and private realm, not only do the political authorities assume certain functions in the sphere of commodity exchange and social labor, but conversely social powers now assume political functions. This leads to a kind of "refeudalization" of the public sphere. Large organizations strive for political compromises with the state and with each other, excluding the public sphere whenever possible. But at the same time the large organizations must assure themselves of at least plebiscitary support from the mass of the population through an apparent display of openness \(demonstrative P~blizitiit\).

The political public sphere of the social welfare state is characterized by a peculiar weakening of its critical functions. At one time the process of making proceedings public \(Publizitdt\) was intended to subject persons or affairs to public reason, and to make political decisions subject to appeal before the court of public opinion.

The idea of the public sphere, preserved in the social welfare state mass democracy, an idea which calls for a rationalization of power through the medium of public discussion among private individuals, threatens to disintegrate with the structural transformation of the public sphere itself. It could only be realized today, on an altered basis, as a rational reorganization of social and political power under the mutual control of rival organizations committed to the public sphere in their internal structure as well as in their relations with the state and each other.
#+end_example


** COMMENT Notes
:PROPERTIES:
:CUSTOM_ID: comment-notes-6401
:END:
Rosenzweig, abundance
#+BEGIN_QUOTE
Ignacio's sudden deletion of Bert should capture our interest as historians since it dramatically illustrates the fragility of evidence in the digital era. If Ignacio had published his satire in a book or magazine, it would sit on thousands of library shelves rather than having a more fugitive existence as magnetic impulses on a web server. Although some historians might object that the Bert Is Evil web site is of little historical significance, even traditional historians should worry about what the digital era might mean for the historical record. U.S. government records, for example, are being lost on a daily basis. Although most government agencies started using e-mail and word processing in the mid-1980s, the National Archives still does not require that digital records be retained in that form, and governmental employees profess confusion over whether they should be preserving electronic files.3 Future historians may be unable to ascertain not only whether Bert is evil, but also which undersecretaries of defense were evil, or at least favored the concepts of the "evil empire" or the "axis of evil." Not only are ephemera like "Bert" and government records made vulnerable by digitization, but so are traditional works–books, journals, and film–that are increasingly being born digitally. As yet, no one has figured out how to ensure that the digital present will be available to the future's historians.

But, as we shall see, tentative efforts are afoot to preserve our digital cultural heritage. If they succeed, historians will face a second, profound challenge–what would it be like to write history when faced by an essentially complete historical record? In fact, the Bert Is Evil story could be used to tell a very different tale about the promiscuity and even persistence of digital materials. After all, despite Ignacio's pleas and Children's Television Workshop's threats, a number of Bert "mirror" sites persist. Even more remarkably, the Internet Archive–a private organization that began archiving the web in 1996–has copies of Bert Is Evil going back to March 30, 1997.

The struggle to incorporate the possibilities of new technology into the ancient practice of history has led, most importantly, to questioning the basic goals and methods of our craft. For example, the Internet has dramatically expanded and, hence, blurred our audiences. A scholarly journal like this one is suddenly much more accessible to high school students and history enthusiasts. And the work of history buffs is similarly more visible and accessible to scholars. We are forced, as a result, to rethink who our audiences really are. Similarly, the capaciousness of digital media means that the page limits of journals like this one are no longer fixed by paper and ink costs. As a result, we are led to question the nature and purpose of the scholarly journals–why do they publish articles with particular lengths and structures? Why do they publish particular types of articles? The simultaneous fragility and promiscuity of digital data requires yet more rethinking–about whether we should be trying to save everything, who is "responsible" for preserving the past, and how we find and define historical evidence.

But much–really, most–of the record of previous historical eras has disappeared. "The members of prehistoric societies did not think they lived in prehistoric times," Washington Post writer Joel Achenbach observes. "They merely lacked a good preservation medium." And non-digital records that have survived into this century–from Greek and Chinese antiquities to New Guinean folk traditions to Hollywood films–are also seriously threatened.9

Print books and records decline slowly and unevenly–faded ink or a broken-off corner of a page. But digital records fail completely–a single damaged bit can render an entire document unreadable. Here is the key difference from the paper era: we need to take action now because digital items very quickly become unreadable, or recoverable only at great expense.

But the medium is far from the weakest link in the digital preservation chain. Well before most digital media degrade, they are likely to become unreadable because of changes in hardware (the disk or tape drives become obsolete) or software (the data are organized in a format destined for an application program that no longer works). The life expectancy of digital media may be as little as ten years, but very few hardware platforms or software programs last that long.

The problem is still worse because of the ability of digital media to create and represent complex, dynamic, and interactive objects–another of their great virtues. Even relatively simple documents that appear to have direct print analogs turn out to be more complex. Printing out e-mail messages makes rapid searches of them impossible and often jettisons crucial links to related messages and attachments.

. But digital information–because it is so easily altered and copied, lacks physical marks of its origins, and, indeed, even the clear notion of an "original"–cannot be authenticated as physical documents and objects can. We have, for example, no way of knowing that forwarded e-mail messages we receive daily have not been altered. In fact, the public archive of Usenet discussion groups contains hundreds of deliberately and falsely attributed messages. "Fakery," write David Bearman and Jennifer Trant, "has not been a major issue for most researchers in the past, both because of the technical barriers to making plausible forgeries, and because of the difficulty with which such fakes entered an authoritative information stream."14 Digital media, tools, and networks have altered the balance.

But this "system" will not work in the digital era because preservation cannot begin twenty-five years after the fact. What might happen, for example, to the records of a writer active in the 1980s who dies in 2003 after a long illness? Her heirs will find a pile of unreadable 5 1/4" floppy disks with copies of letters and poems written in WordStar for the CP/M operating system or one of the more than fifty now-forgotten word-processing programs used in the late 1980s.23

Thus the Internet Archive is very far from the complete solution to the problem of digital preservation. It does not deal with the digital records that vex the National Archives and other repositories because they lack the public accessibility and minimal standardization in HTML of web pages. Nor does it include much formally published literature–e-books and journals–which is sold and hence gated from view. And even for what it has gathered, it has not yet hatched a long-term preservation plan, which would have to incorporate a strategy for continuing access to digital data that are in particular (and time-bound) formats. 

If historians are to set themselves "against forgetting" (in Milan Kundera's resonant phrase), then they may need to figure out new ways to sort their way through the potentially overwhelming digital record of the past. Contemporary historians are already groaning under the weight of their sources. Robert Caro has spent twenty-six years working his way through just the documents on Lyndon B. Johnson's pre-vice-presidential years–including 2,082 boxes of Senate papers. Surely, the injunction of traditional historians to look at "everything" cannot survive in a digital era in which "everything" has survived.55

f historians are going to join in preservation discussions, they will have to make themselves better informed about the simultaneous abundance of historical sources and scarcity of financial resources that lead archivists and librarians to respond with exasperation to scholars' blithe insistence that everything must be saved.

 When Shirley Baker, president of the Association of Research Libraries, challenged historian Robert Darnton's favorable review of Baker's book and noted "choices have always had to be made" in the absence of "greater public commitment to the preservation of the historical record," Darnton responded by urging the establishment of "a new kind of national library dedicated to the preservation of cultural artifacts" (including disappearing digital records) and funded by income generated by the sale or rental of bandwidth.65 


#+END_QUOTE

Turkel, Going Digital
#+BEGIN_QUOTE
 Electronic digital information can be duplicated at near-zero cost, transmitted at the speed of light, stored in infinitesimally small volumes, and created, processed and consumed by machines.  This means that ideas that were more-or-less serviceable in the world before networked computers–ideas about value, property rights, communication, creativity, intelligence, governance and many other aspects of society and culture–are now up for debate.  The emergence of new rights regimes (such as open access, open content and open source) and the explosion of new information are manifestations of these changing costs.

You won’t be able to read everything.  Estimates of the amount of new information that is now created annually are staggering (2003, 2009).  As you become more skilled at finding online sources, you will discover that new material on your topic appears online much faster than you can read it.  The longer you work on something, the more behind you will get.  This is OK, because everyone faces this issue whether they realize it or not.  In traditional scholarship, scarcity was the problem: travel to archives was expensive, access to elite libraries was gated, resources were difficult to find, and so on.  In digital scholarship, abundance is the problem.  What is worth your attention or your trust?

Assume that what you want is out there, and that you simply need to locate it.
#+END_QUOTE
#+begin_src sh :results output
${HOME}/src/extract_pdf_annotations_to_orgmode/vkextract_annotations_to_orgmode_snippet.sh DH/Readings/Many-More-Than-a-Million
#+end_src

#+RESULTS:
#+begin_example
---- HIGHLIGHTS: ---

But when the dirty OCR was paired with the page images, the value of the technique became greatly enhanced because the text was considered good enough for searching, and potentially ambiguous results could be compared with the page image, which was considered authoritative. This strategy of linking page images with OCR enables us to make effective use of large corpora of relatively cheaply scanned books and was, in large measure, effective because it points backwards to the limitations of print: search gets human readers to the page and leaves them to parse out its meaning.

In short, digitization does provide scale \(or quantity\) but does so at the price of rich, largely manual encoding. Visualization, customization, personalization, and similar analytical services increasingly familiar to us depend upon born-digital objects in which a great deal of structural and semantic knowledge has been encoded. The information captured on page images is, by contrast, implicit and often not directly accessible to the machines that will be always their first, often their only, and arguably their most important readers. So given the trade-off between scale and encoding in converted text corpora, what are our options, and where are the opportunities?

Very large collections based on image books differ from first-generation
digital collections by one or more orders of magnitude. Of course, they
are much larger: one internal estimate of Google’s collection in spring
2007 suggested that their searches were scanning at least 2 million
books already. At the same time, these collections are much more
heterogeneous, with books from any library shelf likely to find their way
into the scanning workflow. The range of subjects is thus far broader than
in the curated collections to which we are accustomed. The range of
subjects means that error rates will be much more variable, with OCR of
many texts in non-standard scripts (e.g., Arabic, Classical Greek)
producing little or no searchable text.

Linguistics. Automatically track patterns in morphology, syntax, and semantics across large stretches of time, space, and culture. These studies might be synchronic

Intellectual history. Dan Cohen, assistant professor in the Department of History and Art History at George Mason University, pointed out that the secularization thesis, for example, states that the role of religion declined in general discourse during the 19th century, but most studies of this topic have been anecdotal. If we could track references to the Bible or to other religious terminology across thousands of texts, we could begin to put this thesis on more solid footing.


Social and economic history. Will Thomas, professor of history at the University of Nebraska-Lincoln, pointed out the implications of very large collections for the study of broad socioeconomic topics such as the influence of railroads in U.S. history. Researchers can mine very large collections for references to, and propositional statements about, railroads to trace their development during the 19th century.

This faculty member faces two fundamental challenges: understanding and then communicating with intellectual communities that have different assumed background knowledge, different ideas of what questions are and are not important, different conventions of argumentation, and so on.


. We need to provide not only accurate keystrokes but also semantic markup.




Raw OCR output from page images with human-curated book-level metadata is the starting point for all work. Automatically generated metadata, capturing structural elements \(e.g., tables of contents, chapters/sections, footnotes, marginalia, indices\) will be sufficient for many purposes.

Curated structural metadata. If we have carefully marked the headwords of a reference work such as the Encyclopedia Britannica 13th edition, we can then use the OCR-generated text for each article to train classifiers to distinguish references to various Springfields or Washingtons in unstructured text.


So, this workshop posed one big question: How does scale in content, made possible by mass digitization, change humanities research? As a result of the discussion, we can now pose five questions that parse this broad question into more manageable topics for research:

\) How do traditional archival values migrate into the computationally intensive environment made possible by copious digital data and digital tools?

2\) When only the computer actually "reads" the object or the text, a new and not fully understood relationship is created among author, tools,

objects, and readers \(or users\)


Recognition of the value of the digital research and its expression in digital form, even if that expression is subject to ongoing change by subsequent generations of scholar

Recognition of digital scholarship that focuses on infrastructure. Classicists spent centuries creating the critical editions, lexica, grammars, encyclopedias, commentaries, and technical studies on which twentieth-century scholarship largely depended. We now need machine-actionable knowledge bases that can serve advanced systems and human researchers alike. These knowledge bases have print antecedents but the need to represent them in machine- actionable form and to support complex services may ultimately render them qualitatively different from their print predecessors. We need in the humanities as in the sciences to attract and support some of our most promising scholars to bridge the gap between the needs, present and potential, of the humanities and the possibilities enabled by scholarship.


Finding ways to provide analytical access the Open Content book data now available should be a priority. Scholars should be able to pose questions that analyze very large collections: e.g., what passages from Shakespeare or the Bible appear in different genres over time?

should apply exemplary questions to open collections such as the OCA, access functions that Google, Microsoft, and others provide to end-user services and APIs.

e need to clarify the costs and benefits of book scanning vs. the intensive transcription and markup of complex knowledge sources. We cannot afford to apply human labor and expertise directly to more than a tiny percentage of the published record of humanity. Are there printed materials that would, if carefully converted into machine actionable form, uniquely enhance our ability to analyze relatively unbounded bodies of

We need to understand more clearly how to relate high- value, domain-specific services and data structures to services and data structures that are common to all collections. Every discipline needs text searches, but some communities need different kinds of search.


#+end_example


Annotations:
#+begin_example
--- Annotations: ---
#+end_example

*** Making Lists (Arrays)
#+BEGIN_SRC js
  var historians= ["Edward Gibbon", "Arnold Toynbee", "Leopold von Ranke"];
  for (h of historians) {
    //console.log(h);
  }

#+END_SRC

#+RESULTS:
#+BEGIN_NOTES

#+END_NOTES
*** more objects
#+BEGIN_SRC js
  var greatWar = {
    name: "The First World War",
    start: 1914,
    end: 1918,
    badGuys: ["Germany", "Austria-Hungary", "Ottoman Empire"],
    goodGuys: ["All our Friends"],
    scale: "Catastrophe",
    battles: [
      { name: "The Battle of Vimy Ridge",
        year: 1915,
        casualties: 34000
      }]
  }

  console.log(greatWar["name"] + " lasted for " + (greatWar.end - greatWar.start) + " years.");
//  console.log(greatWar.battles[0].name + " was ferocious and horrific. There were " +
//              greatWar.battles[0].casualties + " casualties.");
#+END_SRC

#+RESULTS:
: The First World War lasted for 4 years.
: The Battle of Vimy Ridge was ferocious and horrific. There were 34000 casualties.
: undefined
